app/Controllers/Home.php

SELECT *
FROM `santri`
WHERE `program` = 'mandiri'
---
    public function beranda()
    {
        $sumTransaksi = new TransferModel();
        $sumTunggakan = new SantriModel();
        $psbmodel = new PsbModel();
        $detailmodel = new DetailModel();

        $resultung = $sumTunggakan;
        $resulSum = $sumTransaksi;
        $psb = $psbmodel;
        $detail = $detailmodel;

        $temptung = $sumTunggakan->where("program", "mandiri")->findAll();

SELECT `status`, COUNT(status) AS jumlah, SUM(tunggakandu) AS totaltunggakan, SUM(daftarulang) AS kewajiban, (SUM(daftarulang) - SUM(tunggakandu)) AS pembayaran
FROM `psb`
GROUP BY `status`
---
                ->where("program", "beasiswa")
                ->groupBy("program")
                ->findAll(),
            "psb" => $psb
                ->select("
        status,
        COUNT(status) AS jumlah,
        SUM(tunggakandu) AS totaltunggakan,
        SUM(daftarulang) AS kewajiban,
        (SUM(daftarulang) - SUM(tunggakandu)) AS pembayaran
    ")
                ->groupBy("status")
                ->findAll(),

SELECT `rekening`, `program`, SUM(daftarulang) as daftarulang, SUM(tunggakan) as tunggakan, SUM(spp) as spp, SUM(uangsaku) as saku, SUM(infaq) as infaq, SUM(formulir) as formulir
FROM `detail`
WHERE MONTH(tanggal) = '11'
AND YEAR(tanggal) = '2025'
GROUP BY `rekening`, `program`
ORDER BY `rekening`
---
    public function koran()
    {
        $detailmodel = new DetailModel();
        $transfermodel = new TransferModel();

        $bulan = $this->request->getGet('bulan') ?? date('m');
        $tahun = $this->request->getGet('tahun') ?? date('Y');
        $rekening = $this->request->getGet('rekening'); // filter rekening

        // Rekap per program
        $detailtrans = $detailmodel
            ->select("rekening, program,
            SUM(daftarulang) as daftarulang,
            SUM(tunggakan) as tunggakan,
            SUM(spp) as spp,
            SUM(uangsaku) as saku,
            SUM(infaq) as infaq,
            SUM(formulir) as formulir")
            ->where("MONTH(tanggal)", $bulan)
            ->where("YEAR(tanggal)", $tahun)
            ->groupBy("rekening, program")
            ->orderBy("rekening")
            ->findAll();