app/Controllers/Page.php

SELECT *
FROM `santri`
---
  public function tambah() {

    $cariNama = new SantriModel();
    $data['cari'] = $cariNama->findAll();
    $santri = $cariNama->findAll();

SELECT DISTINCT `rekening`
FROM `transfer`
ORDER BY `rekening` ASC
---
public function mutasi()
{
    $transferModel = new TransferModel();
    $transferPSB = new TransferModel();
    $transferAlumni = new TransferModel();

    $keyword = $this->request->getPost('keyword');
    $tanggalAwal = $this->request->getPost('tanggal_awal') ?? date('Y-m-d');
    $tanggalAkhir = $this->request->getPost('tanggal_akhir') ?? date('Y-m-d');

    if ($keyword) {
        $transfer = $transferModel->search($keyword);
        $transferpsbmodel = $transferPSB->search($keyword);
        $transferalumnimodel = $transferAlumni->search($keyword);
    } else {
        $transfer = $transferModel;
        $transferpsbmodel = $transferPSB;
        $transferalumnimodel = $transferAlumni;
    }

    // Ambil daftar unik rekening
    $rekeningList = $transferModel->select('rekening')
                                  ->distinct()
                                  ->orderBy('rekening', 'asc')
                                  ->findAll();

SELECT *
FROM `transfer`
WHERE `kelas` != 'lulus'
AND `program` != 'psb'
AND `tanggal` >= '2025-11-30'
AND `tanggal` <= '2025-11-30'
ORDER BY `tanggal` DESC
---
                                          ->where('tanggal >=', $tanggalAwal)
                                          ->where('tanggal <=', $tanggalAkhir)
                                          ->findAll(),
        'transfer' => $transfer->orderBy('tanggal', 'desc')
                               ->where('kelas !=', 'lulus')
                               ->where('program !=', 'psb')
                               ->where('tanggal >=', $tanggalAwal)
                               ->where('tanggal <=', $tanggalAkhir)
                               ->findAll(),